# Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.



sum = 0
a, b = 0, 1
while a+b < 4000000:
    a, b = b, a+b
    if b % 2 == 0:
        sum += b
    else:
        continue
print(sum)