# Найдите сумму всех чисел меньше 1000, кратных 3 или 5.

# Find the sum of all the multiples of 3 or 5 below 1000.

print(sum(range(3, 1000, 3)) + sum(range(5, 1000, 5)))
